Add mermaid charts in readme file
